---
kind: type
id: T:Autodesk.Revit.DB.HomeCamera
source: html/433ba3ea-00f0-0a6b-9543-8f49dc9922e1.htm
---
# Autodesk.Revit.DB.HomeCamera

A structure that contains information about the camera and view for the Home view orientation stored in the model.

## Syntax (C#)
```csharp
public class HomeCamera : IDisposable
```